// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   EditStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell edit command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_EDIT_LIBEDITOR_TITLEBAR    #language eng  "%EMainEditor init failed on TitleBar init\n%N"

#string STR_EDIT_LIBEDITOR_MAINMENU    #language eng  "%EMainEditor init failed on MainMenu init\n%N"

#string STR_EDIT_LIBEDITOR_STATUSBAR   #language eng  "%EMainEditor init failed on StatusBar init\n%N"

#string STR_EDIT_LIBEDITOR_INPUTBAR    #language eng  "%EMainEditor init failed on InputBar init\n%N"

#string STR_EDIT_LIBEDITOR_FILEBUFFER  #language eng  "%EMainEditor init failed on FileBuffer init\n%N"

#string STR_EDIT_LIBEDITOR_TILEBAR_CLEANUP #language eng  "TitleBar cleanup failed\n"

#string STR_EDIT_LIBEDITOR_MENUBAR_CLEANUP #language eng  "MenuBar cleanup failed\n"

#string STR_EDIT_LIBEDITOR_STATUSBAR_CLEANUP #language eng  "StatusBar cleanup failed\n"

#string STR_EDIT_LIBEDITOR_INPUTBAR_CLEANUP #language eng  "InputBar cleanup failed\n"

#string STR_EDIT_LIBEDITOR_FILEBUFFER_CLEANUP #language eng  "FileBuffer cleanup failed\n"

#string STR_EDIT_LIBEDITOR_MAINEDITOR_INIT #language eng  "%EMainEditor init failed on TitleBar init\n%N"

#string STR_EDIT_LIBINPUTBAR_MAININPUTBAR #language eng  "%s"

#string STR_EDIT_LIBMENUBAR_OPEN_FILE  #language eng  "Open File"

#string STR_EDIT_LIBMENUBAR_SAVE_FILE  #language eng  "Save File"

#string STR_EDIT_LIBMENUBAR_EXIT       #language eng  "Exit"

#string STR_EDIT_LIBMENUBAR_CUT_LINE   #language eng  "Cut Line"

#string STR_EDIT_LIBMENUBAR_PASTE_LINE #language eng  "Paste Line"

#string STR_EDIT_LIBMENUBAR_GO_TO_LINE #language eng  "Go To Line"

#string STR_EDIT_LIBMENUBAR_SEARCH     #language eng  "Search"

#string STR_EDIT_LIBMENUBAR_SEARCH_REPLACE #language eng  "Search/Replace"

#string STR_EDIT_LIBMENUBAR_FILE_TYPE  #language eng  "File Type"

#string STR_EDIT_LIBMENUBAR_F1         #language eng  "F1"

#string STR_EDIT_LIBMENUBAR_F2         #language eng  "F2"

#string STR_EDIT_LIBMENUBAR_F3         #language eng  "F3"

#string STR_EDIT_LIBMENUBAR_F4         #language eng  "F4"

#string STR_EDIT_LIBMENUBAR_F5         #language eng  "F5"

#string STR_EDIT_LIBMENUBAR_F6         #language eng  "F6"

#string STR_EDIT_LIBMENUBAR_F7         #language eng  "F7"

#string STR_EDIT_LIBMENUBAR_F8         #language eng  "F8"

#string STR_EDIT_LIBMENUBAR_F9         #language eng  "F9"

#string STR_EDIT_MAIN_INVALID_FILE_NAME #language eng  "%Hedit%N: Invalid File Name\n"

#string STR_EDIT_MAIN_INIT_FAILED      #language eng  "%Hedit%N: Initialization Failed\n"

#string STR_EDIT_MAIN_BUFFER           #language eng  "%Hedit%N: %s\n"

#string STR_EDIT_MAIN_UNKNOWN_EDITOR_ERR #language eng  "%Hedit%N: Unknown Editor Error\n"

#string STR_EDIT_NOREDIRECT            #language eng  "%Hedit%N: Redirection  are not allowed\n"

#string STR_EDIT_LINE_HELP             #language eng  "Edits an ASCII or UNICODE file in full screen"

#string STR_EDIT_VERBOSE_HELP          #language eng  "Edits an ASCII or UNICODE file in full screen.\n"
                                                      "\n"
                                                      "EDIT [file]\n"
                                                      "\n"
                                                      "    file    - Name of file to be edited\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. If the file is not specified, NewFile.txt is edited.\n"
                                                      "    2. The size of file shall not be larger than 16 Mbytes.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "    fs0:\\> edit shell.log\n"
                                                      "\n"



